controltheory/beamer/7/7_4_model.tex
% Created 2016-11-23 Wed 10:32
\documentclass[table]{beamer}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{离散系统数学模型}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性离散系统分析}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}












\section{差分方程}
\label{sec-1}
\begin{frame}
\frametitle{差分方程模型}
\label{sec-1-1}

\begin{itemize}
\item <2->n阶后向差分方程
     \begin{eqnarray*}
      & &c(k)+a_1 c(k-1)+\cdots+a_n c(k-n) \\
      &=& b_0 r(k) +b_1 r(k-1) + \cdots + b_m r(k-m)
     \end{eqnarray*}
     即  $k$  时刻的输出  $c(k)$  与k时刻前  $n$  个时刻输出及前  $m$  个输入,当前时刻输入有关.
\item <3->n阶前向差分方程
     \begin{eqnarray*}
   & &  c(k+n)+a_1 c(k+n-1)+\cdots+a_n c(k) \\
   &=& b_0 r(k+m)+b_1 r(k+m-1)+\cdots+ b_m r(k)
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{差分方程解法: 迭代法}
\label{sec-1-2}

\begin{itemize}
\item 利用差分方程的递推关系,逐步计算  $c(k)$  的值
\item <2->例:  $c(k)=r(k)+5 c(k-1) -6 c(k-2)$  输入  $r(k)=1$ , 初始条件:  $c(0)=0,c(1)=1$
\item <3->解:
     \begin{eqnarray*}
     c(2) & = & 6\\
     c(3) & =& 25 \\
     c(4) &=& 90
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{z变换法}
\label{sec-1-3}

\begin{itemize}
\item 将差分方程与输入进行Z变换,得到输出的Z变换,再进行Z反变换.
\item <2->例: 差分方程  $c(t+2T)+3c(t+T)+2c(t)=0$  初始条件  $c(0)=0,c(1)=1$
\item <3->解:
     \begin{align*}
      &  z^2(c(z)-c(0)-c(1)z^{-1})+3z(c(z)-c(0))+2c(z)  =  0 \\
      &  (z^2+3z+2)c(z) = z \\
      &  c(z) = \frac{z}{z^2+3z+2} 
       =  \frac{z}{z+1}-\frac{z}{z+2}
       =  \frac{1}{1+z^{-1}}-\frac{1}{1+2z^{-1}}\\
      & c(k) = (-1)^k-(-2)^k
     \end{align*}
     其中  $k=0,1,2,\cdots$
\end{itemize}
\end{frame}
\section{脉冲传递函数}
\label{sec-2}
\begin{frame}
\frametitle{脉冲传递函数定义}
\label{sec-2-1}

\begin{itemize}
\item 连续系统:传递函数 (s域)
\item 离散系统:脉冲传递函数 (z域)
\item <2->定义:输出  $c^*(t)$   的Z变换与输入  $r^*(t)$  的Z变换之比(零初始条件下)叫做系统的脉冲传递函数.记为 
        \[G(z)=\frac{C(z)}{R(z)}\]
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{脉冲传递函数意义}
\label{sec-2-2}

\begin{itemize}
\item 加权序列: 输入  $r^*(t)=\delta(t)$  的输出序列称为加权序列,记为  $k^*(t)$
\item <2->脉冲传递函数: 
     \begin{eqnarray*}
     G(z) &=& \frac{{\cal Z}[k^*(t)]}{{\cal Z}[r^*(t)]} \\
     &=& {\cal Z}[k^*(t)]\\
     &=& k(z)
     \end{eqnarray*}
\item <3-> 脉冲传递函数为加权序列  $k^*(t)$  的Z变换
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{两种模型之间的变换关系:}
\label{sec-2-3}

     \begin{eqnarray*}
     c(nT)+\sum_{k=1}^n a_k c((n-k)T) &=& \sum_{k=0}^m b_k r((n-k)T) \\
     G(z) &=& \frac{\sum_{k=0}^{m}b_k z^{-k}}{1+\sum_{k=1}^n a_k z^{-k}}
     \end{eqnarray*}
\begin{itemize}
\item <2-> 差分方程在零初始条件下进行Z变换,得脉冲传递函数.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{脉冲传递函数计算}
\label{sec-2-4}

\begin{itemize}
\item 差分方程Z变换:  $G(z)=\frac{C(z)}{R(z)}$
\item 从传递函数  $G(s)$  求解(部分分式法)
\item <2->例:  $c(nT)=r[(n-k)T]$
\item <3->解:
      \begin{eqnarray*}
      C(z) &=& z^{-k}R(z) \\
      G(z) &=& \frac{C(z)}{R(z)} \\
        &=& z^{-k}
      \end{eqnarray*}
\end{itemize}
\end{frame}
\section{开环系统的脉冲传递函数}
\label{sec-3}
\begin{frame}
\frametitle{开环系统脉冲传递函数}
\label{sec-3-1}

\mode<article>{按定义求,即:  $G(z)=\frac{{\cal Z} [c^*(t)]}{{\cal Z}[r^*(t)]}$ }
\begin{block}{结构图}
\label{sec-3-1-1}

\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick] 
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
%\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
%\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of r] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](r) edge node[midway] {$   $} (s1) ; 
\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_1(s)$}; 
\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[->] node[minimum size=2em,right =of g1] (s2) {}; 
\draw (s2.west)--(s2.north east);\draw[->] (s2.north west) arc (70:0:1.7em);\draw (s2.south) node {$T$};%\draw (s2.north) node[above] {$S$};
\path[](g1) edge node[midway] {$d(t)$} (s2) ; 
\path[red,->] node[draw, inner sep=5pt,right =of s2] (g2) {$G_2(s)$}; 
\path[->] (s2) edge node[midway] {$d^*(t)$} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 
\end{block}
\begin{block}<2->{推导}
\label{sec-3-1-2}

\begin{eqnarray*}
D(z) &=& R(z)G_1(z) \\
C(z) & = & D(z)G_2(z) 
       = G_1(z)G_2(z)R(z) \\
G(z) &=& G_1(z)G_2(z)
\end{eqnarray*}
\end{block}
\end{frame}
\begin{frame}
\frametitle{开环系统脉冲传递函数(续)}
\label{sec-3-2}
\begin{block}{结构图}
\label{sec-3-2-1}

\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick] 
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
%\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
%\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of r] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](r) edge node[midway] {$   $} (s1) ; 
\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_1(s)$}; 
\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of g1] (g2) {$G_2(s)$}; 
\path[->] (g1) edge node[midway] {$   $} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 
\end{block}
\begin{block}<2->{推导}
\label{sec-3-2-2}

\begin{eqnarray*}
C^*(s) & = & [R^*(s)G_1(s)G_2(s)]^* 
       = R^*(s)[G_1(s)G_2(s)]^* \\
C(z) &=& R(z) G_1G_2(z) \\
G(z) &=& G_1G_2(z)
\end{eqnarray*}
\end{block}
\end{frame}
