controltheory/beamer/7/7_4_model.tex
\begin{frame}
\frametitle{开环系统脉冲传递函数(续):有零阶保持器时:}
\label{sec-3-3}
\begin{block}{结构图}
\label{sec-3-3-1}

\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick] 
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
%\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
%\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of r] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](r) edge node[midway] {$   $} (s1) ; 
\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of g1] (g2) {$G_p(s)$}; 
\path[->] (g1) edge node[midway] {$   $} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 
\end{block}
\begin{block}<2->{推导}
\label{sec-3-3-2}

\begin{itemize}
\item <2->   $C^*(s)  =  [R^*(s)\cdot \frac{1-e^{-Ts}}{s}\cdot G_p(s)]^*$
\item <3->   $C^*(s)  = R^*(s)[(1-e^{-Ts})\cdot\frac{G_p(s)}{s}]^*$
\item <4->   $C^*(s)  = R^*(s)[\frac{G_p(s)}{s}-e^{-Ts}\cdot\frac{G_p(s)}{s}]^*$
\item <5->   $C(z) = R(z){\cal Z}[\frac{G_p(s)}{s}]-z^{-1}{\cal Z}[\frac{G_p(s)}{s}]$
\item <6->   $G(z) = (1-z^{-1}){\cal Z}[\frac{G_p(s)}{s}]$
\end{itemize}
\end{block}
\end{frame}
\begin{frame}
\frametitle{开环系统脉冲传递函数示例:  $G_p(s)=\frac{a}{s(s+a)}$}
\label{sec-3-4}

\begin{itemize}
\item <2->解:
     \begin{eqnarray*}
     G(z) & = &(1-z^{-1}){\cal Z}[\frac{a}{s^2(s+a)}] \\
      &=& (1-z^{-1}){\cal Z}[\frac{1}{s^2}-\frac{1}{a}(\frac{1}{s}-\frac{1}{s+a})] \\
      &=& (1-z^{-1})\left[\frac{Tz^{-1}}{(1-z^{-1})^2}-\frac{1}{a}(\frac{1}{1-z^{-1}}-\frac{1}{1-z^{-1}e^{-aT}} )\right]
     \end{eqnarray*}
\end{itemize}
\end{frame}
\section{闭环系统的脉冲传递函数}
\label{sec-4}
\begin{frame}
\frametitle{闭环系统的脉冲传递函数}
\label{sec-4-1}

\mode<article>{按定义求:}

\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick] 
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of p1] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](p1) edge node[midway] {$e(t)$} (s1) ; 
%\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
%\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of s1] (g2) {$G(s)$}; 
\path[->] (s1) edge node[midway] {$e^*(t)$} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
\path[red] node[draw, inner sep=5pt,below =of g2] (h) {$H(s)$}; 
\path[->,draw] (g2.east)+(1em,0) |- (h.east);
\path[->,draw] (h.west) -| node [very near end] {$-$} (p1);
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\path[->] node[minimum size=2em,above =of p1] (sr) {}; 
\draw[dashed] (sr.west)--(sr.north east);\draw[dashed,->] (sr.north west) arc (70:0:1.7em);\draw[dashed] (sr.south) node {$T$};%\draw (sr.north) node[above] {$S$};
\path[dashed,draw](r.east)+(1em,0) |- (sr.west) ; 
\path node[ right =of sr] (i) {$r^*(t)$}; 
\path[dashed,->] (sr) edge node {} (i); 
\end{tikzpicture} 
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<2->{脉冲传递函数}
\label{sec-4-1-1}

\begin{eqnarray*}
\Phi(z) & = & \frac{C(z)}{R(z)}
 = \frac{{\cal Z}[c^*(t)]}{{\cal Z}[r^*(t)]} \\
\Phi_e(z) & = & \frac{E(z)}{R(z)}
    = \frac{{\cal Z}[e^*(t)]}{{\cal Z}[r^*(t)]} 
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<3->{解:}
\label{sec-4-1-2}

\begin{eqnarray*}
C(s) &=& G(s)E^*(s) \\
E(s) &=& R(s)-H(s)C(s) \\
     &=& R(s)-H(s)G(s)E^*(s) \\
\end{eqnarray*}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{闭环系统的脉冲传递函数(续)}
\label{sec-4-2}

\begin{eqnarray*}
E^*(s) &=& R^*(s)-HG^*(s)E^*(s)\\
  &=& \frac{R^*(s)}{1+HG^*(s)} \\
\Phi_e(z) &=& \frac{1}{1+HG(z)} \\
C^*(s) &=& G^*(s)E^*(s)\\
 &=& \frac{G^*(s)R^*(s)}{1+HG^*(s)} \\
\Phi(z) &=& \frac{G(z)}{1+HG(z)} 
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{闭环系统的脉冲传递函数示例:}
\label{sec-4-3}


\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick] 
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
%\path[->] node[minimum size=2em,right =of p1] (s1) {}; 
%\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
%\path[](p1) edge node[midway] {$e(t)$} (s1) ; 
%\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
%\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of p1] (g2) {$G(s)$}; 
\path[->] (p1) edge node[midway] {$e(t)$} (g2); 
\path[->] node[minimum size=2em,right =of g2] (sc) {}; 
\draw (sc.west)--(sc.north east);\draw[->] (sc.north west) arc (70:0:1.7em);\draw (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path (g2) edge node[midway] {$c(t)$} (sc); 
%\path[draw](o.west)+(-1em,0) |- (sc.west) ; 
%\path node[ right =of sc] (c) {$c^*(t)$}; 
%\path[dashed,->] (sc) edge node {} (c); 
\path[->] node[ right =of sc] (o) {$c^*(t)$}; 
\path[->] (sc) edge node {} (o); 

\path[red] node[draw, inner sep=5pt,below =of g2] (h) {$H(s)$}; 
\path[->,draw] (o.west)+(-1em,0) |- (h.east);
\path[->,draw] (h.west) -| node [very near end] {$-$} (p1);
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\path[->] node[minimum size=2em,above =of p1] (sr) {}; 
\draw[dashed] (sr.west)--(sr.north east);\draw[dashed,->] (sr.north west) arc (70:0:1.7em);\draw[dashed] (sr.south) node {$T$};%\draw (sr.north) node[above] {$S$};
\path[dashed,draw](r.east)+(1em,0) |- (sr.west) ; 
\path node[ right =of sr] (i) {$r^*(t)$}; 
\path[dashed,->] (sr) edge node {} (i); 
\end{tikzpicture} 

\begin{itemize}
\item <2->解:
      \begin{eqnarray*}
      E(s) &=& R(s)-H(s)C^*(s)\\
      C(s) & = & G(s)E(s) 
          = G(s)R(s)-G(s)H(s)C^*(s)\\
      C^*(s) &=& GR^*(s)-GH^*(s)C^*(s)
             = \frac{GR^*(s)}{1+GH^*(s)}
      \end{eqnarray*}
\item <3->没有闭环脉冲传递函数
\end{itemize}
\end{frame}
\section{修正Z变换}
\label{sec-5}
\begin{frame}
\frametitle{$c^*(t)$ 与 $c(t)$}
\label{sec-5-1}

\begin{itemize}
\item <2->采样间隔 $\tau$  要远小于系统最小时间常数
\item <3->c(nT)不能反映采样间隔中的信息
\item <4->G(s)要满足:  $n\geq m+2$  ,否则  $c^*(t)$  与  $c(t)$  差别较大.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{修正Z变换}
\label{sec-5-2}

\begin{itemize}
\item 目的:求取采样间隔中的输出值
\item 原理:
\begin{itemize}
\item <2->将周期为  $T$  的原输入采样信号序列 $r^*(t)$ 再次以周期  $\frac{T}{n}$  采样,即得:  $R'(z)=R(z^n)$
\item <3->计算在采样周期  $\frac{T}{n}$  下的响应,即得到原采样间隔中的值.
\end{itemize}
\item 方法:
\begin{itemize}
\item <4->原输入信号Z变换为  $R(z)$ , 将 $z$  替换为:  $z^n$  .
\item <5->以  $\frac{T}{n}$ 重新计算系统脉冲传递函数.
\end{itemize}
\end{itemize}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}{$R(z)$}
\label{sec-5-2-1}

\begin{tikzpicture}[scale=0.5]
