controltheory/beamer/7/7_4_model.tex
\begin{axis}[xticklabel=$\pgfmathprintnumber{\tick}T$]
\addplot+[ycomb] plot coordinates
    {(0,2) (1,1) (2,0.5) (3,4) (4,3) (5,2) (6,1.5) (7,1.5)};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{$R(z^2)$,($T'=\frac{T}{2}$)}
\label{sec-5-2-2}

\begin{tikzpicture}[scale=0.5]
\begin{axis}[ymin=0,xticklabel=$\pgfmathprintnumber{\tick}T$]
\addplot+[ycomb] plot coordinates
    {(0,2) (0.5, 0) (1,1) (1.5,0) (2,0.5)(2.5,0) (3,4)(3.5,0) (4,3)(4.5,0) (5,2)(5.5,0) (6,1.5)(6.5,0) (7,1.5)};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{修正Z变换示例:}
\label{sec-5-3}

\[G(z)=\frac{z}{z-e^{-T}}\]
   $T=1$ ,  $r(t)=1(t)$ , 要求每采样周期中间插入两点.

\begin{itemize}
\item 解:
      \begin{eqnarray*}
      G(z) &= & \frac{z}{z-e^{-1/3}} \\
      r(z) &=& \frac{1}{1-z^{-1}} \\
      r'(z) &=& r(z^3) \\
      &=& \frac{1}{1-z^{-3}} \\
      c'(z) &=& \frac{1}{1-z^{-1}e^{-1/3}}\cdot\frac{1}{1-z^{-3}}
      \end{eqnarray*}
\end{itemize}
\end{frame}

\end{document}
